In [1]:
import pandas as pd
import numpy as np

# DATA SET

In [2]:
df = pd.DataFrame({'name':['Ashwin','Sanjay','Smita','Vaibhav','Abhijeet','Mahadev','Supriya','Pallavi','Sumeet','Chidambar','Subhash'],
                  'place':['Pune','Satara','Sangli','Solapur','Kolhapur','Pune','Satara','Sangli','Solapur','Pune','Satara'],
                  'age':[42,20,25,36,28,24,45,25,21,19,45]})

In [3]:
df

         name     place  age
0      Ashwin      Pune   42
1      Sanjay    Satara   20
2       Smita    Sangli   25
3     Vaibhav   Solapur   36
4    Abhijeet  Kolhapur   28
5     Mahadev      Pune   24
6     Supriya    Satara   45
7     Pallavi    Sangli   25
8      Sumeet   Solapur   21
9   Chidambar      Pune   19
10    Subhash    Satara   45

## How many records are there?

In [4]:
len(df)

11

## List out the names of employee

In [7]:
print(list(df["name"]))

['Ashwin', 'Sanjay', 'Smita', 'Vaibhav', 'Abhijeet', 'Mahadev', 'Supriya', 'Pallavi', 'Sumeet', 'Chidambar', 'Subhash']

## List out the names of column

In [9]:
print(list(df.columns))

['name', 'place', 'age']

## i want top 3 entries

In [10]:
df.head(3)

     name   place  age
0  Ashwin    Pune   42
1  Sanjay  Satara   20
2   Smita  Sangli   25

## i want last 3 entries

In [11]:
df.tail(3)

         name    place  age
8      Sumeet  Solapur   21
9   Chidambar     Pune   19
10    Subhash   Satara   45

## I want record of an employee whose age is 42

In [12]:
df.query('age==42')

     name place  age
0  Ashwin  Pune   42

In [16]:
df[df["age"]==42][["place"]]

  place
0  Pune

## i want name of an emp who is from Kolhapur

In [18]:
df.query('place=="Kolhapur"')[["name"]]

       name
4  Abhijeet

In [20]:
df.groupby("place").get_group("Kolhapur")[["name"]]

       name
4  Abhijeet

## Count of Employee per place
#Return a Series containing counts of unique values.

In [23]:
df["place"].value_counts()

Pune        3
Satara      3
Sangli      2
Solapur     2
Kolhapur    1
Name: place, dtype: int64

## List the unique cities/places

In [26]:
print(list(df.place))

['Pune', 'Satara', 'Sangli', 'Solapur', 'Kolhapur', 'Pune', 'Satara', 'Sangli', 'Solapur', 'Pune', 'Satara']

## Count the unique places

In [27]:
df["place"].nunique()

5

## fetch records for Place Pune

In [29]:
df.query('place=="Pune"').sort_values(by="age")

        name place  age
9  Chidambar  Pune   19
5    Mahadev  Pune   24
0     Ashwin  Pune   42

## fetch name of emp. whose age is min

In [51]:
df.age.min()

19

In [56]:
df.query('age==19')[["name"]]

        name
9  Chidambar

## fetch such records whose name length is>5

In [74]:
df[df.name.map(lambda x:len(x)>5)]

         name     place  age
0      Ashwin      Pune   42
1      Sanjay    Satara   20
3     Vaibhav   Solapur   36
4    Abhijeet  Kolhapur   28
5     Mahadev      Pune   24
6     Supriya    Satara   45
7     Pallavi    Sangli   25
8      Sumeet   Solapur   21
9   Chidambar      Pune   19
10    Subhash    Satara   45

In [76]:
df[df.name.apply(len)>5]

         name     place  age
0      Ashwin      Pune   42
1      Sanjay    Satara   20
3     Vaibhav   Solapur   36
4    Abhijeet  Kolhapur   28
5     Mahadev      Pune   24
6     Supriya    Satara   45
7     Pallavi    Sangli   25
8      Sumeet   Solapur   21
9   Chidambar      Pune   19
10    Subhash    Satara   45

## fetch the record whose name starts with 'M'

In [80]:
df[df.name.str.startswith("M")]

      name place  age
5  Mahadev  Pune   24

## fetch the name and place whose age is divisible by 4

In [86]:
df[df.age%4==0][["name"]]

       name
1    Sanjay
3   Vaibhav
4  Abhijeet
5   Mahadev

In [89]:
df.query('age%4==0')[["name","age"]]

       name  age
1    Sanjay   20
3   Vaibhav   36
4  Abhijeet   28
5   Mahadev   24

## convert places into int ex. Pune=12 Satara=11 likewise

In [94]:
x=list(df.place.unique())

In [95]:
x

['Pune', 'Satara', 'Sangli', 'Solapur', 'Kolhapur']

In [96]:
y=[12,11,10,45,9]

In [97]:
df.replace(x,y)

         name  place  age
0      Ashwin     12   42
1      Sanjay     11   20
2       Smita     10   25
3     Vaibhav     45   36
4    Abhijeet      9   28
5     Mahadev     12   24
6     Supriya     11   45
7     Pallavi     10   25
8      Sumeet     45   21
9   Chidambar     12   19
10    Subhash     11   45

## I want the records of emp whose age is greater than 30

In [98]:
df.query('age>30')

       name    place  age
0    Ashwin     Pune   42
3   Vaibhav  Solapur   36
6   Supriya   Satara   45
10  Subhash   Satara   45

In [99]:
df[df.age>30]

       name    place  age
0    Ashwin     Pune   42
3   Vaibhav  Solapur   36
6   Supriya   Satara   45
10  Subhash   Satara   45

## I want the emp whose name starts with A

In [101]:
df[df.name.str.startswith("A")]

       name     place  age
0    Ashwin      Pune   42
4  Abhijeet  Kolhapur   28

## i want the place of an emp whose name endswith a

In [102]:
df[df.name.str.endswith("a")][["name","place"]]

      name   place
2    Smita  Sangli
6  Supriya  Satara

## what is age of Akshay

In [103]:
df.query('name=="Akshay"')["age"]

Series([], Name: age, dtype: int64)

## who is from place Satara

In [104]:
df.query('place=="Satara"')

       name   place  age
1    Sanjay  Satara   20
6   Supriya  Satara   45
10  Subhash  Satara   45

In [105]:
df.groupby("place").get_group("Satara")

       name   place  age
1    Sanjay  Satara   20
6   Supriya  Satara   45
10  Subhash  Satara   45

In [108]:
df[df.place=="Satara"]

       name   place  age
1    Sanjay  Satara   20
6   Supriya  Satara   45
10  Subhash  Satara   45

## i want record of emp whose age less than  or equal to 25

In [109]:
df.query('age<=25')

        name    place  age
1     Sanjay   Satara   20
2      Smita   Sangli   25
5    Mahadev     Pune   24
7    Pallavi   Sangli   25
8     Sumeet  Solapur   21
9  Chidambar     Pune   19

## list out the name and age of emp from Sangli location

In [127]:
x=df.query('place=="Sangli"')[["name","age"]]
print(list(np.ravel(x)))

['Smita', 25, 'Pallavi', 25]

## add a column with designation

In [184]:
df.insert(3,"designation","student")

In [185]:
df

         name     place  age designation
0      Ashwin      Pune   42     student
1      Sanjay    Satara   20     student
2       Smita    Sangli   25     student
3     Vaibhav   Solapur   36     student
4    Abhijeet  Kolhapur   28     student
5     Mahadev      Pune   24     student
6     Supriya    Satara   45     student
7     Pallavi    Sangli   25     student
8      Sumeet   Solapur   21     student
9   Chidambar      Pune   19     student
10    Subhash    Satara   45     student

## find out is there any duplicate entry?

In [189]:
df.duplicated().sum()

0

## find out the count of null/NaN values

In [191]:
df.isnull().sum()

name           0
place          0
age            0
designation    0
dtype: int64